from math import sqrt
#import numpy as np
import copy


def seidel(A, b, eps):
    """Разработать программу для численного решения СЛАУ методом Зейделя
    с организацией хранения сильно разреженной матрицы большой размерности"""

    n = len(A)
    x = b #[.0 for i in range(n)]

    #depth = 9
    converge = False
    while not converge :
        #depth -=1
        x_new = copy.deepcopy(x)
        for i in range(n):
            s1 = abs(sum(A[i][j] * x_new[j] for j in range(i)))
            s2 = abs(sum(A[i][j] * x[j] for j in range(i + 1, n)))
            x_new[i] = (b[i] - s1 - s2) / A[i][i]
        #if depth ==0: break
        converge = sqrt(sum((x_new[i] - x[i]) ** 2 for i in range(n))) <= eps
        print(x_new)
        x = x_new

    return x


if __name__ == '__main__':
    print(seidel([[3.6, 1.8, -4.7], [2.7, -3.6, 1.9], [1.5, 4.5, 3.3]], [3.8, 0.4, -1.6], 0.001))
    # print(seidel([[3.6, 2.7, 1.5], [1.8, -3.6, 4.5], [-4.7, 1.9, 3.3]], [3.8, 0.4, -1.6], 0.001))
    # print(seidel([[3.6, 1.8, -4.7, 3.8], [2.7, -3.6, 1.9, 0.4], [1.5, 4.5, 3.3,-1.6]], [3.8, 0.4, -1.6], 0.001))
    #print(seidel([[0.945, -0.5882, 0, 0, 0], [-0.017, 0.9806, -0.0114, 0, 0], [0, -0.0153, 0.9876, -0.0107, 0], [0, 0, -0.1111, 0.9188, -0.5], [0, 0, 0, -0.75, 0.9378]], [50,-15.2371,-14.2308,0,-48], 0.0001))
    #[43.5987285945029, -14.959540119074564, -15.21082815402478, -52.57321995394093, -93.2287427654678]
    #print(seidel([3.6, 1.8, -4.7, 3.8, 2.7, -3.6, 1.9, 0.4, 1.5, 4.5, 3.3, -1.6], [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3], [0, 4, 8, 12],0.001))
    # #print(seidel([[0.945,-0.5882,0,0,0],
    #                 [-0.017,0.9806,-0.0114,0,0],
    #                 [0,-0.0153,0.9876,-0.0107,0],
    #                 [0,0,-0.1111,0.9188,-0.5],
    #                 [0,0,0,-0.75,0.9378]], [50,-15.2371,-14.2308,0,-48], 0.0001))